# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
waterstation_list =[
	[ "TG03", "สะพานฝายดินดำ","น้ำแม่ลาว","ท่าก๊อ","แม่สรวย","point(99.47359 19.54796)" ],
  	[ "TG04", "สะพานบ้านดอนสลี", "น้ำแม่ลาว", "ป่าแดด","แม่สรวย","point(99.47661 19.62297 )" ],
  	[ "TG05", "สะพานน้ำลาว","น้ำแม่ลาว", "แม่สรวย", "แม่สรวย","point(99.53839 19.65264 )" ],
  	[ "TG06", "บ้านป่าย้าง","น้ำแม่ลาว","สันทราย","เมือง","point(99.81328 19.84342 )" ],
  	[ "TG11", "เทศบาลตำบลแม่ยาว","น้ำกก","แม่ยาว","เมือง","point(99.77031 19.93539)"],
  	[ "TG12", "บ้านสวนดอก","น้ำแม่กรณ์ขกก","แม่กรณ์","เมือง","point(99.72928 19.84597)"],
  	[ "TG13", "บ้านใหม่กือนา","น้ำกก","ริมกก","เมือง","point(99.93733 19.95689)"],
  	[ "STG01","บ้านห้วยหมากเอียก","แม่เผื่อ","ป่าซาง","เวียงเชียงรุ้ง","point(100.0993328 20.0489686)"],
  	[ "STG02","บ้านเหล่า","ห้วยแม่สัก","ทุ่งก่อ","เวียงเชียงรุ้ง","point(100.04044 20.00916)"],
  	[ "STG03","บ้านแม่เผื่อ","แม่เผื่อ","ดงมหาวัน", "เวียงเชียงรุ้ง","point(100.0268035 20.0071493)"],
  	[ "STG04","บ้านแม่ข้าวต้ม","ห้วยแม่ข้าวต้ม","ท่าสุด","เมือง","point(99.8819162 20.0691292)"],
  	[ "STG05","บ้านนางแลใน","ห้วยนางแลใน","นางแล","เมือง","point(99.8462132 20.0290401)"],
  	[ "STI01","สะพานวัดพระธาตุสามดวง","น้ำส้าน","ป่าหุ่ง","พาน","point(99.6955448 19.571936)"],
  	[ "STI02","สะพานเทศบาลเมืองพาน ซอย 45","น้ำส้าน", "เมืองพาน","พาน","point(99.7383277 19.5516542)"],
  	[ "STI03","สะพานบ้านสันเจริญ","น้ำแม่เปา","แม่เปา","พญาเม็งราย","point(100.1120427 19.9161853)"],
  	[ "STI04","สะพานบ้านสบเปา","น้ำต๊าก","แม่เปา","พญาเม็งราย","point(100.1068252 19.890765)"],
  	[ "STI05","สะพานบ้านทุ่งจ้าว","น้ำต๊าก","เทศบาลพญาเม็งราย","พญาเม็งราย","point(100.139572 19.851362)"],
  	[ "STI06","สะพานแม่น้ำอิง","น้ำอิงรอยต่อ","พญาเม็งราย","พญาเม็งราย","point(100.2006674 19.8332308)"],
  	[ "STI07","สะพานบ้านปางค่า","น้ำหงาว","ตับเต่า","เทิง","point(100.35498 19.80281)"],
  	[ "STI08","สะพานบ้านเอียน","น้ำหงาว","หงาว" "เทิง","point(100.2857  19.70532)"],
  	[ "STK01","สะพานฝายผาม้า","น้ำแม่คำ","แม่คำ","แม่จัน", "point(99.80813 20.230147 )"],
  	[ "STK02","ศรีค้ำ","น้ำแม่คำ","แม่คำ", "แม่จัน","point(99.856936 20.218308)"],
  	[ "STK03","สะพานบ้านฝั่งหมิ่น","แม่น้ำคำ", "แม่คำ","แม่จัน","point(99.904507 20.237627)"],
  	[ "STK04","สะพานบ้านด้าย","น้ำแม่คำ","บ้านด้าย","แม่จัน","point(99.945143 20.2886)"],
  	[ "STK05","ศรีดอนมูล", "น้ำแม่คำ","ศรีดอนมูล","เชียงแสน","point(99.991068 20.305488)"],
  	[ "STK06","สะพานลานทอง","แม่น้ำจัน","ป่าตึง","แม่จัน", "point(99.765371 20.106808)"],
  	[ "STK07","สะพานบ้านป่าตึง","น้ำแม่จัน","ป่าตึง","แม่จัน","point(99.834078 20.13028)"],
  	[ "STK08","สะพานเทศบาลเวียงเชียงของ","น้าห้วยดุก","เทศบาลตำบลเวียงเชียงของ","เชียงของ","point(100.40268 20.25394)"],
  	[ "STK09","สะพานบ้านวัดหลวง","น้ำสม","เทศบาลตำบลเวียงเชียงของ","เชียงของ","point(100.402924 20.263678)"],
  	[ "STK10","บ้านแม่บง","แม่บง","โชคชัย","ดอยหลวง","point(100.1626526 20.1050282)"],
  	[ "STK11","บ้านห้วยไร่","ห้วยไร่","ปงน้อย","ดอยหลวง","point(100.07917 20.10619)"],
  	[ "STK12","บ้านหนองป่าก่อ","แม่บง","หนองป่าก่อ","ดอยหลวง","point(100.1153587 20.1578185)"],
  	[ "STK13","บ้านผาแล","น้ำงาว","ปอ","เวียงแก่น","point(100.433045 19.94148)"],
  	[ "STK14","บ้านท่าข้าม","น้ำงาว","ท่าข้าม","เวียงแก่น","point(100.4893855 20.030556)"],
  	[ "STK15","บ้านหล่ายงาว","น้ำงาว","หล่ายงาว","เวียงแก่น","point(100.5092146 20.1042843)"]
]
waterstation_list.each do |name_station, name_location, river, sub_district, district, lonlat|
  Infomap.create(name_station: name_station, name_location: name_location, river: river, sub_district: sub_district, district: district, lonlat: lonlat )
end

